RubyRails/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?, ?)
---
  def create
      @post = Post.new(post_params)
      @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "こんにちは"], ["body", "笹はおいしい"], ["updated_at", "2019-06-17 09:28:17.449435"], ["id", 2]]
---
  def update
    @post=Post.find(params[:id])
    @post.update(post_params)